In [1]:
import pandas as pd
# uploading the first dataframe
df1 = pd.read_csv('df.csv')

In [2]:
df1

,Location,Price,Bedrooms,Bathrooms,Toilets,Parking
0,Runda,"100,000,000",5,5,Not available,Not available
1,Kileleshwa,"27,500,000",4,5,5,Not available
2,Ruai,"7,800,000",5,4,5,2
3,Karen,"75,500,000",5,5,Not available,Not available
4,Haven,"120,000,000",4,4,4,4
...,...,...,...,...,...,...
315,Kilimani,"26,000,000",3,Not available,Not available,Not available
316,Kilimani,"25,000,000",Not available,Not available,Not available,Not available
317,Kihingo,"165,000,000",4,5,Not available,Not available
318,Chalbi Drive,"66,000,000",4,5,Not available,Not available
319,House No 21,"120,000,000",10,10,Not available,Not available

In [6]:
# uploading the second dataframe
df2 = pd.read_csv('stardata.csv')
df2

                      Location        Price  Bedrooms Bathrooms
0       Nairobi South, Starehe   26,000,000         4        3
1               Karen, Langata  100,000,000         5        4
2                      Nairobi   16,750,000         3        2
3                      Nairobi   13,000,000         3        2
4                      Nairobi   48,000,000         4        5
...                        ...          ...       ...       ...
43051                  Nairobi   48,000,000         4        4
43052                  Nairobi   65,000,000         4        4
43053                  Nairobi   70,000,000         5        5
43054                  Nairobi  400,000,000         4        5
43055                  Nairobi   42,000,000         5        4

[43056 rows x 4 columns]

In [8]:
df = pd.concat([df1, df2], axis=0)
df

,Location,Price,Bedrooms,Bathrooms,Toilets,Parking
0,Runda,"100,000,000",5,5,Not available,Not available
1,Kileleshwa,"27,500,000",4,5,5,Not available
2,Ruai,"7,800,000",5,4,5,2
3,Karen,"75,500,000",5,5,Not available,Not available
4,Haven,"120,000,000",4,4,4,4
...,...,...,...,...,...,...
43051,Nairobi,"48,000,000",4,4,NaN,NaN
43052,Nairobi,"65,000,000",4,4,NaN,NaN
43053,Nairobi,"70,000,000",5,5,NaN,NaN
43054,Nairobi,"400,000,000",4,5,NaN,NaN
43055,Nairobi,"42,000,000",5,4,NaN,NaN

In [10]:
df['Location'].value_counts()

 Nairobi                   21527
 Karen, Langata            12558
 Nairobi South, Starehe     8970
Runda                         59
Lavington                     39
                           ...
Ridge                          1
Hardy Area                     1
Mzima Springs                  1
Muthaiga North Rd              1
Nairobi                        1
Name: Location, Length: 108, dtype: int64

In [11]:
df['Bedrooms'].value_counts()

5                23322
4                14352
3                 5382
5                  139
4                  104
3                   26
6                   25
7                    9
8                    5
10                   4
14                   2
2                    2
Not available        2
16                   1
9                    1
Name: Bedrooms, dtype: int64

In [12]:
df['Bathrooms'].value_counts()

5                16146
4                12558
3                 5382
2                 5382
7                 1794
House             1794
5                   93
6                   82
4                   46
7                   26
Not available       23
3                   19
2                    8
9                    6
8                    6
10                   4
12                   1
340                  1
180                  1
15                   1
11                   1
1                    1
18                   1
Name: Bathrooms, dtype: int64

In [13]:
df['Toilets'].value_counts()

6                89
5                73
Not available    46
4                35
7                27
3                16
2                 9
1                 8
9                 5
8                 4
10                3
12                1
18                1
15                1
210               1
11                1
Name: Toilets, dtype: int64

In [14]:
df['Toilets'].value_counts()

6                89
5                73
Not available    46
4                35
7                27
3                16
2                 9
1                 8
9                 5
8                 4
10                3
12                1
18                1
15                1
210               1
11                1
Name: Toilets, dtype: int64